package com.tangao.test;

public class Poem {

    String[] liBai = {"清平调·其一\n李白\n云想衣裳花想容，春风拂槛露华浓。\n若非群玉山头见，会向瑶台月下逢。",
            "清平调·其二\n李白\n一枝红艳露凝香，云雨巫山枉断肠。\n借问汉宫谁得似，可怜飞燕倚新妆。",
            "清平调·其三\n李白\n名花倾国两相欢，长得君王带笑看。\n解释春风无限恨，沉香亭北倚阑干。",
            "静夜思\n李白\n床前明月光，疑是地上霜。\n举头望明月，低头思故乡。",
            "望庐山瀑布\n李白\n日照香炉生紫烟，遥看瀑布挂前川。\n飞流直下三千尺，疑是银河落九天。",
            "赠汪伦\n李白\n李白乘舟将欲行，忽闻岸上踏歌声。\n桃花潭水深千尺，不及汪伦送我情。",
            "望天门山\n李白\n天门中断楚江开，碧水东流至此回。\n两岸青山相对出，孤帆一片日边来。",
            "早发白帝城\n李白\n朝辞白帝彩云间，千里江陵一日还。\n两岸猿声啼不住，轻舟已过万重山。",
            "独坐敬亭山\n李白\n合沓牵数峰，奔地镇平楚。\n中间最高顶，髣髴接天语。",
            "峨眉山月歌\n李白\n峨眉山月半轮秋，影入平羌江水流。\n夜发清溪向三峡，思君不见下渝州。"};

    String[] duFu = {"绝句\n杜甫\n两个黄鹂鸣翠柳，一行白鹭上青天。\n窗含西岭千秋雪，门泊东吴万里船。",
            "绝句\n杜甫\n江边踏青罢，回首见旌旗。\n风起春城暮，高楼鼓角悲。",
            "江南逢李龟年\n杜甫\n岐王宅里寻常见，崔九堂前几度闻。\n正是江南好风景，落花时节又逢君。",
            "八阵图\n杜甫\n功盖三分国，名高八阵图。\n江流石不转，遗恨失吞吴。",
            "赠花卿\n杜甫\n锦城丝管日纷纷，半入江风半入云。\n此曲只应天上有，人间能得几回闻。",
            "即事\n杜甫\n百宝装腰带，真珠络臂鞲。\n笑时花近眼，舞罢锦缠头。",
            "贫交行\n杜甫\n翻手作云覆手雨，纷纷轻薄何须数。\n君不见管鲍贫时交，此道今人弃如土。",
            "漫成一首\n杜甫\n江月去人只数尺，风灯照夜欲三更。\n沙头宿鹭联拳静，船尾跳鱼拨剌鸣。",
            "少年行\n杜甫\n马上谁家薄媚郎，临阶下马坐人床。\n不通姓字粗豪甚，指点银瓶索酒尝。",
            "规雁\n杜甫\n东来千里客，乱定几年归。\n肠断江城雁，高高正北飞。"};

    String[] wangWei = {"送元二使安西\n王维\n渭城朝雨浥轻尘，客舍青青柳色新。\n劝君更尽一杯酒，西出阳关无故人。",
            "鸟鸣涧\n王维\n人闲桂花落，夜静春山空。\n月出惊山鸟，时鸣春涧中。",
            "鹿柴\n王维\n空山不见人，但闻人语响。\n返景入深林，复照青苔上。",
            "竹里馆\n王维\n独坐幽篁里，弹琴复长啸。\n深林人不知，明月来相照。",
            "送别\n王维\n山中相送罢，日暮掩柴扉。\n春草年年绿，王孙归不归。",
            "杂诗\n王维\n君自故乡来，应知故乡事。\n来日绮窗前，寒梅著花未？",
            "渭城曲\n王维\n渭城朝雨浥轻尘，客舍青青柳色新。\n劝君更尽一杯酒，西出阳关无故人。",
            "红豆\n王维\n红豆生南国，春来发几枝。\n愿君多采撷，此物最相思。",
            "山中\n王维\n荆溪白石出，天寒红叶稀。\n山路元无雨，空翠湿人衣。",
            "少年行\n王维\n一身能擘两雕弧，虏骑千重只似无。\n偏坐金鞍调白羽，纷纷射杀五单于。"};

    String[] liQingZhao = {"如梦令·常记溪亭日暮\n李清照\n常记溪亭日暮，沉醉不知归路，兴尽晚回舟，误入藕花深处。\n争渡，争渡，惊起一滩鸥鹭。",
            "如梦令·昨夜雨疏风骤\n李清照\n昨夜雨疏风骤，浓睡不消残酒，试问卷帘人，却道海棠依旧。\n知否，知否，应是绿肥红瘦。",
            "如梦令·谁伴明窗独坐\n李清照\n谁伴明窗独坐，我共影儿俩个。\n灯尽欲眠时，影也把人抛躲。\n无那，无那，好个凄凉的我。",
            "一剪梅·红藕香残玉蕈秋\n李清照\n红藕香残玉蕈秋，轻解罗裳，独上兰舟。\n云中谁寄锦书来？\n雁字回时，月满西楼。\n花自飘零水自流。\n一种相思，两处闲愁。\n此情无计可消除。\n才下眉头，却上心头。",
            "醉花阴·薄雾浓云愁永昼\n李清照\n薄雾浓云愁永昼，瑞脑消金兽。\n佳节又重阳，玉枕纱厨，半夜凉初透。\n东篱把酒黄昏后，有暗香盈袖。\n莫道不消魂。\n帘卷西风，人比黄花瘦。",
            "武陵春·风住尘香花已尽\n李清照\n风住尘香花已尽，日晚倦梳头。\n物是人非事事休，欲语泪先流。\n闻说双溪春尚好，也拟泛轻舟。\n只恐双溪舴艋舟，载不动、许多愁。",
            "蝶恋花·泪湿罗衣脂粉满\n李清照\n泪湿罗衣脂粉满。\n四叠阳关，唱到千千遍。\n人道山长水又断。\n萧萧微雨闻孤馆。\n惜别伤离方寸乱。\n忘了临行，酒盏深和浅。\n好把音书凭过雁。\n东莱不似蓬莱远。",
            "浣溪沙\n李清照\n淡荡春光寒食天，玉炉沈水袅残烟，梦回山枕隐花钿。\n海燕未来人斗草，江梅已过柳生绵，黄昏疏雨湿秋千。",
            "点绛唇·寂寞深闺\n李清照\n寂寞深闺，柔肠一寸愁千缕。\n惜春春去。几点催花雨。\n倚遍阑干，只是无情绪。\n人何处。\b连天衰草，望断归来路。",
            "渔家傲·雪里已知春信至\n李清照\n雪里已知春信至，寒梅点缀琼枝腻，香脸半开娇旖旎，当庭际，玉人浴出新妆洗，造化可能偏有意，故教明月珑珑地，共赏金尊沈绿蚁。\n莫辞醉，此花不与群花比。"};

    String[] xinQiJi = {"永遇乐·京口北固亭怀古\n辛弃疾\n千古江山，英雄无觅，孙仲谋处。\n舞榭歌台，风流总被、雨打风吹去。\n斜阳草树，寻常巷陌，人道寄奴曾住。\n想当年，金戈铁马，气吞万里如虎。\n元嘉草草，封狼居胥，赢得仓皇北顾。\n四十三年，望中犹记，烽火扬州路。\n可堪回首，佛狸祠下，一片神鸦社鼓。\n凭谁问：廉颇老矣，尚能饭否？",
            "青玉案·元夕\n辛弃疾\n东风夜放花千树，更吹落，星如雨。\n宝马雕车香满路。\n凤箫声动，玉壶光转，一夜鱼龙舞。\n蛾儿雪柳黄金缕，笑语盈盈暗香去。\n众里寻他千百度，蓦然回首，那人却在，灯火阑珊处。",
            "西江月·夜行黄沙道中\n辛弃疾\n明月别枝惊鹊，清风半夜鸣蝉。\n稻花香里说丰年，听取蛙声一片。\n七八个星天外，两三点雨山前。\n旧时茅店社林边，路转溪桥忽见。",
            "鹧鸪天·著意寻春懒便回\n辛弃疾\n著意寻春懒便回。\n何如信步两三杯。\n山才好处行还倦，诗未成时雨早催。\n携竹杖，更芒鞋。\n朱朱粉粉野蒿开。\n谁家寒食归宁女，笑语柔桑陌上来。",
            "鹧鸪天·白苎新袍入嫩凉\n辛弃疾\n白苧新袍入嫩凉。\n春蚕食叶响回廊。\n禹门已准桃花浪，月殿先收桂子香。\n鹏北海，凤朝阳。\n又携书剑路茫茫。\n明年此日青云去，却笑人间举子忙。",
            "鹧鸪天·陌上柔条初破芽\n辛弃疾\n陌上柔条初破芽。\n东邻蚕种已生些。\n平冈细草鸣黄犊，斜日寒林点暮鸦。\n山远近，路横斜。\n青旗沽酒有人家。\n城中桃李愁风雨，春在溪头野荠花。",
            "鹧鸪天·千丈清溪百步雷\n辛弃疾\n千丈清溪百步雷。\n柴门都向水边开。\n乱云剩带炊烟去，野水闲将白影来。\n 穿窈窕，历崔嵬。\n东林试问几时栽。\n动摇意态虽多竹，点缀风流却少梅。",
            "鹧鸪天·欲上高楼去避愁\n辛弃疾\n欲上高楼去避愁，愁还随我上高楼。\n经行几处江山改，多少亲朋尽白头！\n归休去，去归休，不成人总要封侯。\n浮云出处元无定，得似浮云也自由。",
            "鹧鸪天·困不成眠奈夜何\n辛弃疾\n困不成眠奈夜何。\n情知归未转愁多。\n暗将往事思量遍，谁把多情恼乱他。\n些底事，误人哪。\n不成真个不思家。\n娇痴却妒香香睡，唤起醒松说梦些。",
            "鹧鸪天·一夜清霜变鬓丝\n辛弃疾\n一夜清霜变鬓丝。\n怕愁刚把酒禁持。\n玉人今夜相思不，想见频将翠枕移。\n真个恨，未多时。\n也应香雪减些儿。\n菱花照面须频记，曾道偏宜浅画眉。"};

    String[] yueFei = {"池州翠微亭\n岳飞\n经年尘土满征衣，特特寻芳上翠微。\n好山好水看不足，马蹄催趁月明归。",
            "登池州翠微亭诗\n岳飞\n经年尘土满征衣，特特寻芳上翠微。\n好水好山看不足，马蹄催趁月明归。",
            "归赴行在过上竺寺偶题\n岳飞\n强胡犯金阙，驻跸大江南。\n一帝双魂杳，孤臣百战酣。\n兵威空朔漠，法力仗瞿昙。\n恢复山河日，捐躯分亦甘。",
            "游嵬石山寺\n岳飞\n嵬石山前寺，林泉胜景幽。\n紫金诸佛相，白雪老僧头。\n潭水寒生月，松风夜带秋。\n我来属龙语，为雨济民忧。",
            "过张溪赠张完\n岳飞\n无心买酒谒青春，对镜空嗟白发新。\n花下少年应笑我，垂垂羸马访高人。",
            "从驾游内苑应制\n岳飞\n敕报游西内，春光霭上林。\n花围千朵锦，柳捻万株金。\n燕绕龙旗舞，莺随凤辇吟。\n君王多雨露，化育一人心。",
            "题池州翠光寺\n岳飞\n爱此倚栏干，谁同寓目閒。\n轻阴弄晴日，秀色隐空山。\n岛树萧疏外，征帆杳霭间。\n予虽江上老，心羡白云还。",
            "题雩都华严寺\n岳飞\n手持竹节访黄龙，旧穴空遗虎子踪。\n云锁断崖无觅处，半山松竹撼秋风。",
            "题青泥市萧寺壁\n岳飞\n雄气堂堂贯斗牛，誓将直节报君仇。\n斩除顽恶还车贺，不问登坛万户修。",
            "寄浮图慧海\n岳飞\n湓浦庐山几度秋，长江万折向东流。\n男儿立志扶王室，圣主专师灭虏酋。\n功业要刊燕石上，归休终伴赤松游。\n丁宁寄语东林老，莲社从此著力修。"};

    String[] baiPu = {"天净沙·秋\n白朴\n孤村落日残霞，轻烟老树寒鸦。\n一点飞鸿影下，青山绿水，白草红叶黄花。",
            "天净沙·春\n白朴\n春山暖日和风，阑干楼阁帘栊，杨柳秋千院中。\n啼莺舞燕，小桥流水飞红。",
            "天净沙·冬\n白朴\n一声画角谯门，丰庭新月黄昏，雪里山前水滨。\n竹篱茅舍，淡烟衰草孤村。",
            "天净沙·夏\n白朴\n云收雨过波添，楼高水冷瓜甜，绿树阴垂画檐。\n纱厨藤簟，玉人罗扇轻缣。",
            "喜春来·题情\n白朴\n从来好事天生俭，自古瓜儿苦后甜。\n奶娘催逼紧拘钳，甚是严。\n越间阻越情忺！"};

    String[] maZhiYuan = {"天净沙·秋思\n马致远\n枯藤老树昏鸦，小桥流水人家。\n古道西风瘦马，夕阳西下，断肠人在天涯。",
            "双调·寿阳曲\n马致远\n渔灯暗，客梦回，一声声滴人心碎。\n孤舟五更家万里，是离人几行情泪。",
            "落梅风·蔷薇露\n马致远\n蔷薇露，荷叶雨，菊花霜冷香庭户。\n梅梢月斜人影孤，恨薄情四时辜负。",
            "落梅风·人初静\n马致远\n人初静，月正明。\n纱窗外玉梅斜映。\n梅花笑人偏弄影，月沉时一般孤零。",
            "落梅风·夕阳下\n马致远\n夕阳下，酒旆闲。\n两三航未曾着岸。\n落花水香茅舍晚，断桥头卖鱼人散。"};

    String[] guanHanQing = {"南吕·四块玉闲适\n关汉卿\n适意行，安心坐。\n渴时饮，饥时餐，醉时歌。\n困来时就向莎茵卧。\n日月长，天地阔，闲快活。",
            "双调·沉醉东风\n关汉卿\n夜月青楼凤箫，春风翠髻金翘。\n雨云浓，心肠俏，俊庞儿玉软香娇。\n六幅湘裙一搦腰，间别来十分瘦了。",
            "仙吕·一半儿题情\n关汉卿\n云鬟雾鬓胜堆鸦，浅露金莲籁绛纱。\n不比等闲墙外花。\n骂你个俏冤家，一半儿难当一半儿耍。",
            "南吕·四块玉别情\n关汉卿\n自送别，心难舍，一点相思几时绝？\n凭阑袖拂杨花雪。\n溪又斜，山又遮，人去也！",
            "正宫·白鹤子\n关汉卿\n花边停骏马，柳外缆轻舟。\n湖内画船交，湖上骅骝骤。"};

    String[] taiGeEr = {"I came out alone on my way to my tryst.",
            "But who is this that follows me in the silent dark?",
            "I move aside to avoid his presence but I escape him not.",
            "Before meeting the right one， maybe God wants us to meet other people;when we finally meet the person，we will know how to be grateful.",
            "The bird wishes it were a cloud， the cloud wishes it were a bird.",
            "Just because someone doesn't love you the way you want them to， doesn't mean they don't love you put one's heart and soul into.",
            "I love you， not because of who you are， but because I like with you in together the time feeling.",
            "Even if sad， also do not bend the brows， because you never know who is falling in love with your smile.",
            "God loves man's lamp-lights better than his own great stars.",
            "I feel at this moment you gaze upon my heart， like the sunny silence of the morning upon the lonely field whose harvest is over."};

}
